In [10]:
import pandas as pd

from pandas import Series,DataFrame

# pandas的数据结构介绍
## Series

In [11]:
obj = Series([4,7,-5,3])

obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = Series([4,7,5,-3],index=['d','b','a','c'])

obj2

d    4
b    7
a    5
c   -3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
obj2['a']

5

In [8]:
obj2[['c','a','d']]

c   -3
a    5
d    4
dtype: int64

In [9]:
obj2[obj2>0]

d    4
b    7
a    5
dtype: int64

In [12]:
obj2*2

d     8
b    14
a    10
c    -6
dtype: int64

In [13]:
import numpy as np

np.exp(obj2)

d      54.598150
b    1096.633158
a     148.413159
c       0.049787
dtype: float64

In [14]:
'b' in obj2

True

In [15]:
'e' in obj2

False

In [16]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}

obj3 = Series(sdata)

In [17]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
states = ['California','Ohio','Oregon','Texas']

obj4 = Series(sdata,index=states)

obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [21]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [25]:
obj4.name = 'population'

obj4.index.name = 'state'

obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [26]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [27]:
obj.index = ['Bob','Steve','Jeff','Ryan']

obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

In [28]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
        'year':[2000,2001,2002,2001,2002],
        'pop':[1.5,1.7,3.6,2.4,2.9]}

frame = DataFrame(data)

frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [29]:
DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [30]:
frame2 = DataFrame(data,columns=['year','state','pop','debt'],
                  index=['one','two','three','four','five'])

frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [31]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [32]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [33]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [34]:
frame2.ix['three']

H:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [35]:
frame2.debt = 16.5

frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [37]:
frame2.debt = np.arange(5)

frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [38]:
val = Series([-1.2,-1.5,-1.7],index=['two','four','five'])

frame2.debt = val

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [39]:
frame2['easrern'] = frame2.state=='Ohio'

frame2

       year   state  pop  debt  easrern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [41]:
del frame2['easrern']

In [42]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [43]:
pop = {'Nevada':{2001:2.4,2002:2.9},
      'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

frame3 = DataFrame(pop)

frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [44]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [46]:
frame3.index.name = 'year'

frame3.columns.name = 'state'

frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [47]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [48]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

## 索引对象

In [49]:
obj = Series(range(3),index=['a','b','c'])

index = obj.index

index

Index(['a', 'b', 'c'], dtype='object')

In [50]:
index[1:]

Index(['b', 'c'], dtype='object')

In [51]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [52]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [53]:
'Ohio' in frame3.columns

True

In [54]:
2003 in frame3.index

False

# 基本功能

## 重新索引

In [55]:
obj = Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [56]:
obj2 = obj.reindex(['a','b','c','d','e'],fill_value=0)

obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [57]:
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])

obj3

0      blue
2    purple
4    yellow
dtype: object

In [58]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [59]:
obj3.reindex(range(6),method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

## 丢弃指定轴上的项

In [62]:
obj = Series(np.arange(5),index=['a','b','c','d','e'])

obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [63]:
new_obj = obj.drop('c')

In [64]:
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [65]:
obj.drop(['a','d'])

b    1
c    2
e    4
dtype: int32

## 索引，选取和过滤

In [66]:
obj = Series(np.arange(4),index=['a','b','c','d'])

obj['b']

1

In [67]:
obj[1]

1

In [68]:
obj[2:4]

c    2
d    3
dtype: int32

In [69]:
obj['b':'c']

b    1
c    2
dtype: int32

In [70]:
obj[[1,3]]

b    1
d    3
dtype: int32

In [71]:
obj[['b','a']]

b    1
a    0
dtype: int32

In [72]:
obj[obj<2]

a    0
b    1
dtype: int32

In [73]:
data = DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [75]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [76]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [1]:
import numpy as np

import pandas as pd

from pandas import Series,DataFrame

## 算术运算和数据对齐

In [2]:
s1 = Series([7.3,-2.6,3.4,1.5],index=['a','c','d','e'])

s2 = Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','e'])

In [3]:
s1

a    7.3
c   -2.6
d    3.4
e    1.5
dtype: float64

In [4]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
e    3.1
dtype: float64

In [5]:
s1 + s2

a    5.2
c    1.0
d    NaN
e    0.0
e    4.6
f    NaN
dtype: float64

In [9]:

df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [10]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

## 在算术方法中填充值

In [11]:
df1 = DataFrame(np.arange(12).reshape((3,4)),columns=list('abcd'))

df2 = DataFrame(np.arange(20).reshape((4,5)),columns=list('abcde'))

In [12]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [13]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [14]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [15]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

## DataFrame与Series之间的运算

In [16]:
arr = np.arange(12).reshape((3,4))

arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [17]:
arr[0]

array([0, 1, 2, 3])

In [18]:
arr - arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [19]:
frame = DataFrame(np.arange(12).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

series = frame.ix[0]

H:\Anaconda\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

In [20]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [21]:
series

b    0
d    1
e    2
Name: Utah, dtype: int32

In [22]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

## 函数应用和映射

In [36]:
frame = DataFrame(np.random.randn(4,3),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

frame

               b         d         e
Utah    0.295762  1.015065 -0.979627
Ohio   -1.082100 -0.013690  1.350124
Texas   0.826325 -0.884382 -0.641191
Oregon -1.087330 -0.584854 -0.112497

In [37]:
np.abs(frame)

               b         d         e
Utah    0.295762  1.015065  0.979627
Ohio    1.082100  0.013690  1.350124
Texas   0.826325  0.884382  0.641191
Oregon  1.087330  0.584854  0.112497

In [38]:
f = lambda x:x.max() - x.min()

frame.apply(f)

b    1.913655
d    1.899447
e    2.329751
dtype: float64

In [39]:
def f(x):
    return Series([x.min(),x.max()],index=['min','max'])

frame.apply(f)

            b         d         e
min -1.087330 -0.884382 -0.979627
max  0.826325  1.015065  1.350124

## 排序和排名

In [40]:
obj = Series(range(4),index=['d','a','b','c'])

obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [41]:
frame = DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],columns=['d','a','b','c'])

frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [42]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [43]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

## 汇总和计算描述统计

In [44]:
df = DataFrame(10*np.random.randn(4,2),index=list('abcd'),columns=['one','two'])

df

        one        two
a -5.597827  -1.937417
b  2.842906   9.148275
c -3.295347 -12.282585
d  6.024170  -8.445667

In [45]:
df.describe()

            one        two
count  4.000000   4.000000
mean  -0.006525  -3.379348
std    5.371764   9.380045
min   -5.597827 -12.282585
25%   -3.870967  -9.404896
50%   -0.226221  -5.191542
75%    3.638222   0.834006
max    6.024170   9.148275

In [46]:
df.var()

one    28.855850
two    87.985244
dtype: float64

In [47]:
df.cumprod()

          one          two
a   -5.597827    -1.937417
b  -15.914095   -17.724022
c   52.442463   217.696810
d  315.922321 -1838.594678

## 处理缺失数据

In [48]:
from numpy import nan as NA

data = Series([1,NA,3,NA,7])

data

0    1.0
1    NaN
2    3.0
3    NaN
4    7.0
dtype: float64

In [49]:
data.dropna()

0    1.0
2    3.0
4    7.0
dtype: float64

In [50]:
data[data.notnull()]

0    1.0
2    3.0
4    7.0
dtype: float64

In [51]:
data = DataFrame([[1,6.5,3],[1,NA,NA],[NA,NA,NA],[NA,6.5,3]])

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [52]:
cleaned = data.dropna()

cleaned

     0    1    2
0  1.0  6.5  3.0

In [53]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [54]:
df = DataFrame(np.random.randn(7,3))

df.ix[:4,1] = NA

df.ix[:2,2] = NA

df

H:\Anaconda\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until
H:\Anaconda\lib\site-packages\ipykernel_launcher.py:5: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """

          0         1         2
0 -0.022112       NaN       NaN
1  0.360563       NaN       NaN
2 -0.856750       NaN       NaN
3  1.101814       NaN -0.688802
4  0.295830       NaN  1.669456
5 -0.376357 -0.175386  1.312898
6 -0.538080 -1.093695  0.250462

In [55]:
df.fillna(0)

          0         1         2
0 -0.022112  0.000000  0.000000
1  0.360563  0.000000  0.000000
2 -0.856750  0.000000  0.000000
3  1.101814  0.000000 -0.688802
4  0.295830  0.000000  1.669456
5 -0.376357 -0.175386  1.312898
6 -0.538080 -1.093695  0.250462

In [56]:
df.fillna({1:0.5,2:-1})

          0         1         2
0 -0.022112  0.500000 -1.000000
1  0.360563  0.500000 -1.000000
2 -0.856750  0.500000 -1.000000
3  1.101814  0.500000 -0.688802
4  0.295830  0.500000  1.669456
5 -0.376357 -0.175386  1.312898
6 -0.538080 -1.093695  0.250462